Repository: inferno681/swiss_bro
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

# prev_button
source: ⬅️ prev
ru: ⬅️ Назад

# next_button
source: ➡️ next
ru: ➡️ Вперёд

# ruble_line
source: 💵 Approximately <b>{rub_price} ₽</b>
ru: 💵 Примерно <b>{rub_price} ₽</b>

# update_price_message
source: 💰 The price of <b>{product}</b> has been updated: <b>{new_price}</b> {rub_line} 📉 Minimum price during the period: <b>{min_price}</b> 📈 Maximum price during the period: <b>{max_price}</b> 🕒 Monitoring started: <b>{created_at}</b> 📅 Last update: <b>{updated_at}</b> 🔗 <a href="{url}">Go to the website</a>
ru: 💰 Цена на <b>{product}</b> обновилась: <b>{new_price}</b> {rub_line} 📉 Минимальная цена за период: <b>{min_price}</b> 📈 Максимальная цена за период: <b>{max_price}</b> 🕒 Наблюдение начато: <b>{created_at}</b> 📅 Последнее обновление: <b>{updated_at}</b> 🔗 <a href="{url}">Перейти на сайт</a>

source: Add good
ru: Добавить товар

# send_link_message
source: Please send the product link.
ru: Пришлите ссылку на товар.

# incorrect_url_message
source: The link must start with one of the following sites: {sites}
ru: Ссылка должна начинаться с одного из следующих сайтов: {sites}

# error_message
source: An error occurred. Please try again from the beginning.
ru: Произошла ошибка. Попробуйте начать сначала.

# already_exist_message
source: This product is already being tracked.
ru: Этот товар уже отслеживается.

# link_received_message
source: Got it! What will you name the product?
ru: Получил! Как назовешь товар?

# good_added_message
source: Product "{name}" with price {price} has been added.
ru: Товар "{name}" с ценой {price} добавлен.

# price_in_rubles
source: Approximate price in rubles: {price} ₽
ru: Примерная цена в рублях {price} ₽

# no_price_message
source: Failed to get the price from the link.
ru: Не удалось получить цену по ссылке.

# not_url_message
source: This doesn’t look like a link. Please send a valid link.
ru: Это не похоже на ссылку. Пришли правильную ссылку.

source: Check goods
ru: Проверить все товары

# ruble_price_info
source: Approximately {rub_price} rubles
ru: Примерно {rub_price} рублей

source: Check one
ru: Статистика по товару

# pagination_message
source: Select a product to view statistics (page {current_page} / {pages}): {lines}'
ru: Выберите товар для просмотра статистики (стр. {current_page} / {pages}): {lines}

# no_message_error
source: Error: message is unavailable.
ru: 'Ошибка: сообщение недоступно.

# check_one_cancel_message
source: Statistics view canceled.
ru: Просмотр статистики отменен.

# product_not_found_message
source: ⚠️ Product with name "{product_name}" not found.
ru: ⚠️ Товар с именем «{product_name}» не найден.

# rub_line
source: 💵 Approximately <b>{rub_price} ₽</b>
ru: 💵 Примерно <b>{rub_price} ₽</b>

# price_info_message
source: Failed to get the price from the link.
ru: 💰 Цена на <b>{product}</b>: <b>{new_price}</b> {rub_line} 📉 Минимальная цена за период: <b>{min_price}</b> 📈 Максимальная цена за период: <b>{max_price}</b> 🕒 Наблюдение начато: <b>{created_at}</b> 📅 Последнее обновление: <b>{updated_at}</b> 🔗 <a href="{url}">Перейти на сайт</a>

# user_not_recognized
source: Failed to identify the user 🚫
ru: Не удалось определить пользователя 🚫

# start_message
source: Hello, {name}! This bot monitors product prices on the following sites: {sites}
ru: Привет, {name}! Этот бот мониторит цены на товары на следующих сайтах: {sites}

source: Delete good
ru: Удалить товар

# deletion_canceled_message
source: Deletion canceled.
ru: Удаление отменено.

# product_deleted_message
source: Product "{product_name}" has been deleted.
ru: Товар "{product_name}" удалён.

# language_change
source: Change language
ru: Сменить язык

# choose_lang_message
source: Choose your language:
ru: Выберите язык:

# lang_change_cancel_message
source: Language change canceled.
ru: Смена языка отменена.

# incorrect_lang_code
source: Invalid language code.
ru: Неверный код языка.
